{
  "title": {
    "media": {
      "url": "https://media.istockphoto.com/id/2185445305/photo/artificial-intelligence-and-machine-learning.jpg?s=2048x2048&w=is&k=20&c=aIf39NCsutTTkn15ZVy0U63mBzjfIbS8UzeAcYmQYh4=",
      "credit": "<a href='https://www.istockphoto.com/photo/artificial-intelligence-and-machine-learning-gm2185445305-604210820'>iStock</a>"
    },
    "text": {
      "headline": "The Old Era: The Historical Foundation of Machine Learning <br/> 1943 - 1973",
      "text": "<p>“From the 1940s to the early 1970s, machine learning emerged as a field of curiosity and experimentation. Pioneers introduced neural models, early algorithms, and symbolic systems that laid the groundwork for modern AI. Despite limitations and the first ‘AI winter,’ this era established the foundations that shaped the future of machine learning.”  </p>"
    }
  },
  "events": [
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=BDr0HxUI3Bo",
        "credit": "<a href='https://www.youtube.com/watch?v=BDr0HxUI3Bo'>YouTube</a>"
      },
      "start_date": {
        "year": "1943"
      },
      "text": {
        "headline": "McCulloch & Pitts’ Neuron Model",
        "text": "<p>Warren McCulloch and Walter Pitts introduced a mathematical model of the biological neuron. This model showed that simple logical functions could be computed by networks of neurons. Their work laid the theoretical foundation for neural networks and inspired future research in artificial intelligence.</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=dDTf7QYUq48",
        "credit": "<a href='https://www.youtube.com/watch?v=dDTf7QYUq48'>YouTube</a>"
      },
      "start_date": {
        "year": "1949"
      },
      "text": {
        "headline": "Hebb’s Theory: \"Neurons that fire together wire together\"",
        "text": "<p>Psychologist Donald Hebb published The Organization of Behavior, proposing the idea that “neurons that fire together wire together.” This explained how neural pathways strengthen through repeated activation. The concept influenced how machine learning algorithms are designed to adjust weights between connections.</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=wXMLF54AUwU",
        "credit": "<a href='https://www.youtube.com/watch?v=wXMLF54AUwU'>YouTube</a>"
      },
      "start_date": {
        "year": "1950"
      },
      "text": {
        "headline": "Alan Turing’s “Turing Test”",
        "text": "<p>Alan Turing proposed the “Imitation Game,” later called the Turing Test, to evaluate whether a machine could mimic human intelligence. His paper, Computing Machinery and Intelligence, raised fundamental questions about machine reasoning. It set the stage for decades of AI and ML exploration.</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=4h0QpNWrPbg",
        "credit": "<a href='https://www.youtube.com/watch?v=4h0QpNWrPbg'>YouTube</a>"
      },
      "start_date": {
        "year": "1951"
      },
      "text": {
        "headline": "Samuel’s Checkers Program",
        "text": "<p>Arthur Samuel developed a checkers-playing program capable of improving its strategies the more it played. This was one of the first demonstrations of machine learning, showing that machines could adapt and learn from experience. Samuel’s work also popularized the term “machine learning.”</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=3FX2wmJ1fAQ",
        "credit": "<a href='https://www.youtube.com/watch?v=3FX2wmJ1fAQ'>YouTube</a>"
      },
      "start_date": {
        "year": "1956"
      },
      "text": {
        "headline": "Dartmouth Workshop (Birth of AI)",
        "text": "<p>The Dartmouth Summer Research Project on Artificial Intelligence officially established AI as a research field. Led by John McCarthy, Marvin Minsky, and others, the workshop gathered scientists to discuss possibilities of machines simulating human learning. Machine learning became a recognized subfield under the larger AI umbrella.”</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=Ip6RIHwi21c",
        "credit": "<a href='https://www.youtube.com/watch?v=Ip6RIHwi21c'>YouTube</a>"
      },
      "start_date": {
        "year": "1957"
      },
      "text": {
        "headline": "The Perceptron",
        "text": "<p>Frank Rosenblatt introduced the Perceptron, an early type of artificial neural network. The perceptron was capable of simple pattern recognition, which generated great optimism in the AI community. Though later criticized for its limitations, it marked an important milestone in neural network development.”</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=8jGpkdPO-1Y",
        "credit": "<a href='https://www.youtube.com/watch?v=8jGpkdPO-1Y'>YouTube</a>"
      },
      "start_date": {
        "year": "1966"
      },
      "text": {
        "headline": "ELIZA and Early Symbolic AI",
        "text": "<p>Joseph Weizenbaum created ELIZA, a simple program that simulated human conversation using pattern-matching techniques. Around the same time, symbolic AI approaches dominated research, focusing on rules and logic rather than learning. These projects demonstrated potential but also exposed limitations in handling real-world complexity.”</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=0yqPXTNau5w",
        "credit": "<a href='https://www.youtube.com/watch?v=0yqPXTNau5w'>YouTube</a>"
      },
      "start_date": {
        "year": "1967"
      },
      "text": {
        "headline": "Nearest Neighbor Algorithm",
        "text": "<p>The k-Nearest Neighbors (k-NN) algorithm emerged as one of the earliest practical methods for pattern recognition. It classified data points by comparing them to known examples in memory. This algorithm demonstrated the value of statistical approaches to machine learning.”</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=WqbTMQDGfYs",
        "credit": "<a href='https://www.youtube.com/watch?v=WqbTMQDGfYs'>YouTube</a>"
      },
      "start_date": {
        "year": "1969"
      },
      "text": {
        "headline": "Perceptron Limitations Exposed",
        "text": "<p>Marvin Minsky and Seymour Papert published Perceptrons, a book showing that perceptrons could not solve many complex problems. Their critique slowed research in neural networks for over a decade. This event highlighted the challenges of early machine learning and contributed to the upcoming “AI winter”.</p>"
      }
    },
    {
      "media": {
        "url": "https://www.youtube.com/watch?v=UeE7qqoeCXg",
        "credit": "<a href='https://www.youtube.com/watch?v=UeE7qqoeCXg'>YouTube</a>"
      },
      "start_date": {
        "year": "1973"
      },
      "text": {
        "headline": "First AI Winter (Lighthill Report)",
        "text": "<p>The Lighthill Report in the UK criticized the lack of practical results from AI research. As a result, funding was drastically reduced, and many projects came to a halt. This “AI winter” marked the end of the early foundation era, as enthusiasm for machine learning waned.</p>"
      }
    },
    {
      "start_date": {
        "day": "19",
        "month": "08",
        "year": "2025"
      },
      "text": {
        "headline": "REFERENCES/CITATIONS",
        "text": "<br/><p>Concise Software blog. A brief history of machine learning. (2020, October 6). Concise Software. https://concisesoftware.com/blog/history-of-machine-learning/</p><br/><p>TechTarget. Karjian, R. (2024, June 13). History and evolution of machine learning: A timeline. TechTarget. https://www.techtarget.com/whatis/feature/History-and-evolution-of-machine-learning-A-timeline</p>"
      }
    }
  ]
}
